app/controllers/deliveries_controller.rb

  def central_report
    prawnto :prawn=>{:page_layout=>:landscape}

    deliveries = Delivery.this_years_deliveries
    if deliveries.blank?
---
SELECT * FROM "deliveries" WHERE (delivery_date >= '2013-01-01' AND delivery_date <= '2013-09-03')

  def admin_report
     prawnto :prawn=>{:page_layout=>:portrait}

    @current_delivery_date = Delivery.next_delivery_date
    deliveries = Delivery.next_deliveries

    if deliveries.blank? or @current_delivery_date.blank?
---
SELECT * FROM "deliveries" WHERE (delivery_date >= '2013-09-03') ORDER BY delivery_date ASC LIMIT 1

  def delivery_report
     #prawnto :prawn=>{:page_layout=>:landscape}

    @current_delivery_date = Delivery.next_delivery_date
    #deliveries = Delivery.team_report
    #teams = Delivery.team_report
    team_nums = Team.team_nums_for_current_delivery_week

    if team_nums.blank? or @current_delivery_date.blank?
      flash[:notice] = "There are no deliveries scheduled."
      redirect_to :action => 'index'
    else
    #group results by team
    @report = []

    team_nums.each do |num|
          vins = Team.find(:all, :conditions => ["team_num =?", num.team_num], :include => :vincentian, :select => "DISTINCT vincentian_id")
---
SELECT * FROM "deliveries" WHERE (delivery_date >= '2013-09-03') ORDER BY delivery_date ASC LIMIT 1
SELECT DISTINCT team_num FROM "teams" INNER JOIN "deliveries" ON "deliveries".id = "teams".delivery_id WHERE (deliveries.delivery_date = NULL) ORDER BY teams.team_num ASC