app/controllers/recipients_controller.rb

SELECT * FROM "recipients" WHERE ("recipients"."id" = 159)
---
  def deliveries

    if params[:id].present?
      deliveries = Recipient.find(params[:id]).deliveries.find(:all) do