app/controllers/teams_controller.rb

  def new
     # Queries are here for clarity purposes in this demo
    # It's of course a better idea to create a method in your model

    deliveries = Delivery.find(:all, :include => :recipient) do
---
SELECT * FROM "recipients" WHERE ("recipients"."id" IN (120,123,128,124,121,119,118,116,115,114,113,112,111,110,130,109,108,107,106,104))

  def vincentians
    # returns list of vincentians for master deliveries list @ /teams/new

    if params[:id].present?
      vincentians = Delivery.find(params[:id]).vincentians.find(:all) do
---
SELECT * FROM "deliveries" WHERE ("deliveries"."id" = 537)

  def create

  team_errors = [] #array of errors for the create operation

    vin_ids_hash = params.reject { |k,v| k.to_s[0,6] != 'vin_id' } #grab vincentian ids
    del_ids_hash = params.reject { |k,v| k.to_s[0,6] != 'del_id' } #grab delivery ids

    #validate
    if vin_ids_hash.blank? or del_ids_hash.blank?
      team_errors << "Select both vincentian(s) and deliveries(s)."
    else
      vin_ids = vin_ids_hash.values #grab just the values from the hash
      del_ids = del_ids_hash.values #grab just the values from the hash
    end


    existing_team_num = Team.existing_team_num(vin_ids, del_ids) #check for existing team
    next_team_num = Team.next_team_num if existing_team_num.blank?
---
INSERT INTO "teams" ("delivery_id", "updated_at", "team_num", "vincentian_id", "created_at") VALUES(540, '2013-09-04 03:54:56', 195, 22, '2013-09-04 03:54:56')
SELECT * FROM "teams" ORDER BY team_num DESC LIMIT 1